In [3]:
import pandas as pd
import numpy as np

'''
Pandas contain 2 DataStructures
    -> Series (1-D array or Vector)
    -> Dataframe (2-D or matrix)

Series and Dataframe contains:
    -> default and
    -> key indexing
'''

# Create Dataframe Manuallly

In [5]:
data=np.array([[12,'Awaneesh',98.99],
         [13,'Amol',90.87],
         [14,'Ashwini',91.99],
         [15,'Ameya',94.77]])

In [6]:
data.shape

(4, 3)

In [15]:
column=['Roll','Name','Percentage']
index1=['Row1','Row2','Row3','Row4']  ################### Key indexing is used

In [65]:
df=pd.DataFrame(data,columns=column,index=index1)

In [66]:
df

     Roll      Name Percentage
Row1   12  Awaneesh      98.99
Row2   13      Amol      90.87
Row3   14   Ashwini      91.99
Row4   15     Ameya      94.77

In [36]:
type(df)

pandas.core.frame.DataFrame

##### Dataframe using default indexing ----------------------------------------------------------------------------

In [60]:
df2=pd.DataFrame(data=data,columns=column) ### default indexing is used

In [61]:
df2

  Roll      Name Percentage
0   12  Awaneesh      98.99
1   13      Amol      90.87
2   14   Ashwini      91.99
3   15     Ameya      94.77

In [62]:
df.axes

[Index(['Row1', 'Row2', 'Row3', 'Row4', 5, 'row5'], dtype='object'),
 Index(['Roll', 'Name', 'Percentage'], dtype='object')]

In [63]:
df.columns

Index(['Roll', 'Name', 'Percentage'], dtype='object')

In [120]:
df

      Roll      Name Percentage
Row_0   12  Awaneesh      98.99
Row_1   13      Amol      90.87
Row_2   14   Ashwini      91.99
Row_3   15     Ameya      94.77
Row_4   16     Sahil      97.98

### Append row using append function -- pass dictionary to append function

In [55]:
df.append({'Roll':16, 'Name':'Sejal','Percentage':89.87},ignore_index=True)

C:\Users\amol\AppData\Local\Temp\ipykernel_14276\1009426353.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'Roll':16, 'Name':'Sejal','Percentage':89.87},ignore_index=True)

  Roll      Name Percentage
0   12  Awaneesh      98.99
1   13      Amol      90.87
2   14   Ashwini      91.99
3   15     Ameya      94.77
4   17     Awana       89.9
5   16     Sejal      89.87

### Append data to DataFrame directly by specifying loc

In [67]:
df.loc['Row5']=[17,'Awana',89.90]

In [68]:
df

     Roll      Name Percentage
Row1   12  Awaneesh      98.99
Row2   13      Amol      90.87
Row3   14   Ashwini      91.99
Row4   15     Ameya      94.77
Row5   17     Awana       89.9

In [69]:
df2

  Roll      Name Percentage
0   12  Awaneesh      98.99
1   13      Amol      90.87
2   14   Ashwini      91.99
3   15     Ameya      94.77

In [ ]:
'''
It is important to note that we can not add new row in the dataframe by using 
                                df.iloc
as iloc is a default indexing for values which are not existing (it means that at index 4 there is no data so we can not add
data there)



df.loc will work for integer index as well as string index in loc[4] or loc['4'] ---> both are permitted

'''

In [71]:
df2.loc['4']=[16,'Sejal',89.78]       ## observe the value in loc.. its not integer..

In [72]:
df2

  Roll      Name Percentage
0   12  Awaneesh      98.99
1   13      Amol      90.87
2   14   Ashwini      91.99
3   15     Ameya      94.77
4   16     Sejal      89.78

In [73]:
df2.loc[5]=[17,'Nilam',78.90]         ## observe the value in loc.. its integer..

In [74]:
df2

  Roll      Name Percentage
0   12  Awaneesh      98.99
1   13      Amol      90.87
2   14   Ashwini      91.99
3   15     Ameya      94.77
4   16     Sejal      89.78
5   17     Nilam       78.9

#### now check it for iloc

In [75]:
df2.iloc[6]=[18,'Dipika',89.90]               ## used iloc.. this will not work as iloc uses default indexing

IndexError: iloc cannot enlarge its target object

# Deleting columns and rows from Dataframe

In [76]:
df

     Roll      Name Percentage
Row1   12  Awaneesh      98.99
Row2   13      Amol      90.87
Row3   14   Ashwini      91.99
Row4   15     Ameya      94.77
Row5   17     Awana       89.9

### drop row

'''
while dropping row, we MUST provide the index of the row also we must provide axis=1 and inplace=True
'''

In [79]:
df.drop(index='Row5',axis=1,inplace=True)

In [80]:
df

     Roll      Name Percentage
Row1   12  Awaneesh      98.99
Row2   13      Amol      90.87
Row3   14   Ashwini      91.99
Row4   15     Ameya      94.77

### Drop column

''' while dropping column, we MUST provide the column name of the column also we must provide axis=0 and inplace=True '''

In [81]:
df.drop(columns='Percentage',axis=0,inplace=True)

In [82]:
df

     Roll      Name
Row1   12  Awaneesh
Row2   13      Amol
Row3   14   Ashwini
Row4   15     Ameya

# Broadcasting operation on DataFram

In [106]:
data=np.array([[12,'Awaneesh',98.99],
         [13,'Amol',90.87],
         [14,'Ashwini',91.99],
         [15,'Ameya',94.77]])

df=pd.DataFrame(data=data,columns=['Roll','Name','Percentage'],index=['Row_0','Row_1','Row_2','Row_3'])

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row_0 to Row_4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Roll        5 non-null      object
 1   Name        5 non-null      object
 2   Percentage  5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

### lets do broadcasting---> subtract 2.00% from percentage marks of every student

In [103]:
# astype() casts pandas object to a specific type
# here type of 'Percentage' column is object, so we need to first convert it into float by using astype and then subtract 2.0

df['Percentage']=df['Percentage'].astype(float)-2.0

In [104]:
df

      Roll      Name  Percentage
Row_0   12  Awaneesh       96.99
Row_1   13      Amol       88.87
Row_2   14   Ashwini       89.99
Row_3   15     Ameya       92.77

In [108]:
df['Percentage']

Row_0    98.99
Row_1    90.87
Row_2    91.99
Row_3    94.77
Name: Percentage, dtype: object

In [110]:
df['Percentage'].astype(float).mean()

94.155

### check the type of dataframe column before applying broadcasting function

In [111]:
df['Percentage'].astype(float).max()

98.99

In [112]:
df['Percentage'].astype(float).median()

93.38

In [114]:
df[df['Percentage'].astype(float)<95]

      Roll     Name Percentage
Row_1   13     Amol      90.87
Row_2   14  Ashwini      91.99
Row_3   15    Ameya      94.77

In [116]:
df.loc['Row_1']

Roll             13
Name           Amol
Percentage    90.87
Name: Row_1, dtype: object

In [117]:
df

      Roll      Name Percentage
Row_0   12  Awaneesh      98.99
Row_1   13      Amol      90.87
Row_2   14   Ashwini      91.99
Row_3   15     Ameya      94.77

### appending row

In [118]:
df.loc['Row_4']=[16,'Sahil',97.98]

In [119]:
df

      Roll      Name Percentage
Row_0   12  Awaneesh      98.99
Row_1   13      Amol      90.87
Row_2   14   Ashwini      91.99
Row_3   15     Ameya      94.77
Row_4   16     Sahil      97.98

# Reading xlsx file in pandas

In [122]:
placement=pd.read_excel('Placement_Statistics.xlsx')

In [123]:
placement.head()

,Unnamed: 0,Name of Student,College Name,Branch / Specialization,Division (e.g. C for students of C division out of 3 divisions of BE Mechanical),Company Placed Final Offers,Company 1,Company 2,Company 3,Company 4
0,3,Akshay Rajendra Shinde,PCET's PCCOE,Computer Engineering,A,BMC Software,BMC Software,NaN,NaN,NaN
1,14,Tejas Bhausaheb Borde,PCET's PCCOE,Computer Engineering,A,"Syngenta, Veritas",Syngenta,Veritas,NaN,NaN
2,26,Aditya Hemant Deo,PCET's PCCOE,Computer Engineering,A,Mindbody,Mindbody,NaN,NaN,NaN
3,39,Prasad Rajesh Gaikwad,PCET's PCCOE,Computer Engineering,A,Quantiphi,Quantiphi,NaN,NaN,NaN
4,40,Shlok Prashant Gangatirkar,PCET's PCCOE,Computer Engineering,A,Druva,Druva,NaN,NaN,NaN

In [124]:
placement['Division (e.g. C for students of C division out of 3 divisions of BE Mechanical)'].value_counts()

B    16
C    13
A    11
D     6
Name: Division (e.g. C for students of C division out of 3 divisions of BE Mechanical), dtype: int64

In [125]:
placement['Company Placed Final Offers'].unique()

array(['BMC Software', 'Syngenta, Veritas', 'Mindbody', 'Quantiphi',
       'Druva', 'SAP', 'Veritas', 'EQ Technologic', 'Pubmatic',
       'AFour Technologies', 'Syngenta', 'TCS(Codevita)',
       'Sahaj Software', 'Infocusp Innovations Pvt Ltd'], dtype=object)

In [126]:
placement['Company Placed Final Offers'].nunique()

14

In [131]:
list(placement.groupby('Company Placed Final Offers')['Name of Student'])

[('AFour Technologies',
  14            Rakesh Anil Minase
  22       Ashish Dattatraya Pawar
  24    Tejas Girishkumar Podutwar
  28      Tushar Damodhar Varkhede
  31     Rushikesh Karbhari Markad
  36         Dhairya Rohit Chhabra
  39       Pratik Shivaji Padalkar
  42       Prince Vinayak Gangurde
  45          MITALI SURESH GADIYA
  Name: Name of Student, dtype: object),
 ('BMC Software',
  0     Akshay Rajendra Shinde
  5       Niraj Vijay Garudkar
  10      Keyur Chetan Kolambe
  Name: Name of Student, dtype: object),
 ('Druva',
  4     Shlok Prashant Gangatirkar
  25            Gaurav Vijay Rasal
  Name: Name of Student, dtype: object),
 ('EQ Technologic',
  11       Soham Parag Kulkarni
  20       Srushti Suresh Patil
  23       Karthi Dhana Sekaran
  41    Vedant Pratim Chaudhari
  Name: Name of Student, dtype: object),
 ('Infocusp Innovations Pvt Ltd',
  33    Lalit Vilas Shirsath
  37     Akash Uttam Gomsale
  Name: Name of Student, dtype: object),
 ('Mindbody',
  2         Aditya Hemant Deo
  17    Tanvi Ashok Nimbalkar
  30    Sejal Tukaram Zambare
  Name: Name of Student, dtype: object),
 ('Pubmatic',
  12               Durga Vijay Late
  13             Rohit Mahadev More
  38    Shantanu Nilkanth Mirajgave
  Name: Name of Student, dtype: object),
 ('Quantiphi',
  3          Prasad Rajesh Gaikwad
  8        Avishkar Arjun Hongekar
  9       Shivam Ashish Khandelwal
  15          Pranav Bhaskar Muthe
  18              Anuj Asit Pandya
  21    Sainath Nandkumar Pattewar
  34        Mohini Anandrao Shinde
  40            Pawan Ishwar Kadam
  44        Siddharth Sayan Poddar
  Name: Name of Student, dtype: object),
 ('SAP',
  6        Shamik Sanjay Ghadge
  16    Mohit Jitendra Nathwani
  Name: Name of Student, dtype: object),
 ('Sahaj Software',
  29    Vighnesh Sanjay Pathrikar
  Name: Name of Student, dtype: object),
 ('Syngenta',
  19    Shreyash Shivaji Patil
  Name: Name of Student, dtype: object),
 ('Syngenta, Veritas',
  1     Tejas Bhausaheb Borde
  27     Sumedha Nitin Zaware
  Name: Name of Student, dtype: object),
 ('TCS(Codevita)',
  26        Rizwan Yusuf Sayyed
  32    Nikita Sukhadev Gaikwad
  Name: Name of Student, dtype: object),
 ('Veritas',
  7     Palak Ramesh Gupta
  35    Pratik Kumar Patil
  43      Dev Vikas Juneja
  Name: Name of Student, dtype: object)]

In [132]:
placement.shape

(46, 10)

In [133]:
placement.columns

Index(['Unnamed: 0', 'Name of Student', 'College Name',
       'Branch / Specialization',
       'Division (e.g. C for students of C division out of 3 divisions of BE Mechanical)',
       'Company Placed Final Offers', 'Company 1', 'Company 2', 'Company 3',
       'Company 4'],
      dtype='object')

# Apply() function in Pandas applied on Series object

In [134]:
import os

In [135]:
os.chdir('D:\Datasets\KNN')

In [136]:
new_df=pd.read_csv('Social_Network_Ads.csv')

In [137]:
new_df.head()

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0
2   26            43000          0
3   27            57000          0
4   19            76000          0

In [138]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              400 non-null    int64
 1   EstimatedSalary  400 non-null    int64
 2   Purchased        400 non-null    int64
dtypes: int64(3)
memory usage: 9.5 KB

In [146]:
series_sal=new_df['EstimatedSalary']

In [149]:
def fun(x):
    return x/2
series_sal.apply(fun)  #---------------------------------------------------------------

0       9500.0
1      10000.0
2      21500.0
3      28500.0
4      38000.0
        ...
395    20500.0
396    11500.0
397    10000.0
398    16500.0
399    18000.0
Name: EstimatedSalary, Length: 400, dtype: float64

In [159]:
series_sal.apply(lambda x:x+1000 if x>20000 else x)

0      19000
1      20000
2      44000
3      58000
4      77000
       ...
395    42000
396    24000
397    20000
398    34000
399    37000
Name: EstimatedSalary, Length: 400, dtype: int64

# Fetching columns from dataframe

In [160]:
new_df

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [162]:
# suppose we want first two columns

x=new_df[new_df.columns[:2]]

In [163]:
x

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

In [168]:
type(x)

pandas.core.frame.DataFrame

In [164]:
# fetching a single column from dataframe

In [165]:
y=new_df['Purchased']

In [166]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [167]:
type(y)

pandas.core.series.Series